# Student Activity: Reading Stocks Data from a CSV

## 1. Import the pandas library as _pd_

In [1]:
# initial imports
import pandas as pd
from pathlib import Path

## 2. Create a dataframe reading a CSV file

In [4]:
# set the file path
csv_path = ("../Resources/amd_stock_data.csv")

# create a Pandas dataframe from a csv file
data = pd.read_csv(csv_path)

## 3. Exploring the data

In [5]:
# get the first 10 rows from the dataframe
data.head()

   4/29/09  3.51  11537950   3.4  3.56  3.38
0  4/30/09  3.61  18193730  3.55  3.73  3.53
1   5/1/09  3.82  16233940  3.55  3.90  3.55
2   5/4/09  4.26  21236940  3.90  4.30  3.83
3   5/5/09  4.32  16369170  4.36  4.39  4.11
4   5/6/09  4.31  15075630  4.45  4.45  4.12

## 4. Fixing column names

In [9]:
# set colum names
col_names = ["date", "close", "volume", "open", "high", "low"]


# recreate the dataframe
data = pd.read_csv(csv_path, header=None)

# add columns names
data.columns = (col_names)

## 5. Get the first 10 rows

In [10]:
# get the first 10 rows from the dataframe
data.head()

      date  close    volume  open  high   low
0  4/29/09   3.51  11537950  3.40  3.56  3.38
1  4/30/09   3.61  18193730  3.55  3.73  3.53
2   5/1/09   3.82  16233940  3.55  3.90  3.55
3   5/4/09   4.26  21236940  3.90  4.30  3.83
4   5/5/09   4.32  16369170  4.36  4.39  4.11

## 6. Get the bottom 10 rows

In [11]:
# get the bottom 10 rows from the dataframe
data.tail()

         date  close    volume   open   high    low
2512  4/23/19  27.97  41583740  28.18  28.49  27.79
2513  4/24/19  28.46  51487330  28.10  28.85  27.93
2514  4/25/19  27.66  56709000  28.67  28.86  27.36
2515  4/26/19  27.88  48736860  27.66  27.90  27.05
2516  4/29/19  27.69  44265600  27.90  28.14  27.50